# -*- eval: (setq org-media-note-screenshot-image-dir (concat default-directory "./static/TypeError: <flask_restful.marshal_with object at 0x11bb91fd0> is not JSON serializable/")); -*-
:PROPERTIES:
:ID:       4B68197E-3F32-42F6-AC51-DE89451FF85D
:END:
#+LATEX_CLASS: my-article
#+DATE: <2022-07-01 Fri 14:08>
#+TITLE: TypeError: <flask_restful.marshal_with object at 0x11bb91fd0> is not JSON serializable

#+BEGIN_SRC python :results values list :exports both
from flask_restful import Resource, fields, marshal_with, reqparse
from models import Project, Tool
import jieba
import json

tools_resource_fields = {
    'name': fields.String,
    'size': fields.String,
    'number': fields.Integer,
    'description': fields.String,
}

parser = reqparse.RequestParser()
parser.add_argument('search')


class ToolsAPI(Resource):
    def post(self):
        args = parser.parse_args()
        search = args['search']
        results = []

        seg_list = jieba.cut(sentence=search)
        ars_list = []
        for seg in seg_list:
            projects = Project.query.whoosh_search(seg, or_=True).all()
            if len(projects) != 0:
                ars_list.append(projects)
        try:
            projects_set = reduce(lambda x, y: set(x).intersection(set(y)),
                                  ars_list)
        except TypeError:
            projects_set = []

        if len(projects_set) != 0:
            for project in projects_set:
                project_tool = dict()
                project_tool[u'project_id'] = project.id
                project_tool[u'project_title'] = project.title
                project_tool[u'tools'] = []
                tools = Tool.query.filter_by(project_id=project.id).all()
                for tool in tools:
                    project_tool[u'tools'].append(
                        marshal_with(tool, tools_resource_fields))
                results.append(project_tool)
        return results
#+END_SRC

** 第三次尝试, 不使用 ~marshal_with~ 装饰器, 而直接使用 ~marshal~ 函数
#+BEGIN_SRC python
from flask_restful import fields, marshal
import json
tool = {
    'size': u'',
    'project_title': u'737\u98de\u673a\u6ed1\u884c\u706f\u66f4\u6362',
    'number': 1,
    'name': u'\u4e00\u5b57\u89e3\u5200',
    'project_id': 332,
    'id': 3111,
    'description': u''
}

tools_resource_fields = {
    'name': fields.String,
    'size': fields.String,
    'number': fields.Integer,
    'description': fields.String,
}

print(marshal(tool, tools_resource_fields))
#+END_SRC

#+RESULTS:
: - OrderedDict([('description', u''), ('number', 1), ('name', u'\u4e00\u5b57\u89e3\u5200'), ('size', u'')])

原来只能使用 ~mashal~ 不能使用 ~mashal_with~.

